---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBottomDir1Generic
source: html/b56e365d-7917-5779-cff5-89cd111a33e6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBottomDir1Generic Property

"Bottom/Interior Major Bar Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemBarTypeBottomDir1Generic { get; }
```